import heapq

n = int(input())
a = []
for _ in range(n):
    a.append(int(input()))

# Куча событий: (время рождения, индекс аквариума)
events = []
for i in range(n):
    t = max(1000 - a[i], 1)
    # при добавлении события в кучу, автоматич упоряд по первому эл кортежа (времени)
    heapq.heappush(events, (t, i))

pos = 0          # текущая позиция Игоря (индекс аквариума)
cur_time = 0     # текущее время
# Сколько рыбок уже родилось в каждом аквариуме
born = [0] * n

while events:
    # Извлекаем ближайшее по времени событие из кучи.
    t, i = heapq.heappop(events)
    # 1 сек, чтобы игорь добежал до следующего аквариума
    travel = abs(i - pos)
    # сколько времени прошло + 1 сек > время рождения
    # если Игорь не успевает
    if cur_time + travel > t:
        print(t)
        break
    
    # Игорь успевает — добежит до аквариума i
    cur_time = t
    pos = i
    
    # Вычисляем следующее рождение в аквариуме i
    # Увеличиваем число родившихся рыбок
    born[i] += 1
    # Вычисляем размер популяции в i-ом аквариуме
    new_size = a[i] + born[i]
    # Вычисляем время следующего рождения в этом же аквариуме.
    next_t = t + max(1000 - new_size, 1)
    # Добавляем новое событие будущего рождения обратно в кучу 
    # для дальнейшей обработки
    heapq.heappush(events, (next_t, i))
