
s = list(map(int, input().split()))
# вырезаем размер массива из введенных данных
p = s.pop(0)
# индекс
i = 1
# кол-во подряд идущ одиннак щариков за одно нахождения
# за один проход
c = 1
# итоговое кол-во
itog = 0
while i < len(s):
    # ищем повторение
    while i < len(s) and s[i] == s[i-1]:
        c += 1
        i += 1
    # если повторений >= 3, то вырезаем и запоминаем кол-во
    # возвращаемся в начало
    # сначала ищем повторения
    if c >= 3:
        itog += c
        del s[i-c:i]
        i = 1
        c = 1
    else:
    # если нет повторений, то продвигаемся дальше
        c = 1
        i += 1
print(itog)
