#include <iostream>
using namespace std;

// 2 3 10
// right = 3*10 = 30
// mid = 15
// находим сколько широт и высот (k, l) в стороне 
// перемножаем и получаем кол-во дипломов
// mid/w  *  mid/h = 15/2 * 15/3 = 35
// 
// ширина квдрата = w + w + w... = w * k
// длина (ширина) квадрата = h + h + h... = h*l
//  _________
// |_|       |
// |         |
// |         |
// |_________|
//  
int main() {
    // ширина диплома, высота диплома, кол-во дипломов
    long long w, h, n;
    cin >> w >> h >> n;
    
    // Бинарный поиск для определения мин размера стороны квадратной доски
    long long left = 0;                    // минимальный размер
    long long right = max(w, h) * n;       // максимальный размер (худший случай)
    
    while (left < right) {

        long long mid = (left + right) / 2;  
        
        // Сколько дипломов поместится на доске mid × mid?
        long long count = (mid / w) * (mid / h);
        
        if (count >= n) {
            right = mid;      // хватает — пробуем меньше
        } else {
            left = mid + 1;   // не хватает — нужно больше
        }
    }
    
    cout << left << endl;
    return 0;
}