#  ___________
# |  _  |     |
# | |_| |     |
# |_____|     |
# |           |
# |           |
# |           |
# |___________|
# 
#  ___________
# | |   _   | |
# | |  |_|  | |
# | |_______| |
# |           |
# |           |
# |           |
# |           |
# |           |
# |___________|

# так как площадь имеет разные стороны, то расположение модулей вдоль сторон имеет значение
# длины вдоль ширины иои длина вдоль длины имеет значение
# (горизотальное положение или вертикальное) 
# как только нашли максимальное количество модулей в площади - смотрим >= нужного кол-ва
# если >= n, то мы можем увеличить d (толщину защитного слоя модуля), 
# пока нужное нам кол-во сохраняется
 
def good(d):
    a1 = a + 2 * d
    b1 = b + 2 * d
    return max((w // a1) * (h // b1),(w // b1) * (h // a1)) >= n

# кол-во модулей, a * b - стороны модуля, w * h - стороны всей площади
n, a, b, w, h = map(int, input().split())

left = 0
# мин сторона площади
# для нахождения размера толщины защитного поля модуля
# (со всех сторон одинаковый a + d, b + d)
# изменение размера (площади) модуля = (a+2d) x (b+2d)
right = min(w, h) + 1

while right - left > 1:
    mid = (left + right) // 2

    if good(mid):
        left = mid
    else:
        right = mid
# максимальная возможная толщина защитного слоя
print(left)