def ok(x):
    # Проверяем, можно ли сформировать r бригад с неудобством <= x
    # счётчик бригад
    groups = 0
    # индекс первого человека в текущей бригаде
    i = 0
    
    while i < n and groups < r:
        # Проверяем, есть ли еще "c" человек начиная с позиции i
        # c - кол-во человек в бригаде должно быть
        if i + c > n:
            return False
        
        # Проверяем неудобство бригады [i, i+c-1]
        # расчёт разницы в росте
        # не превышает ли допустимую разницу в росте
        if a[i + c - 1] - a[i] <= x:
            # Можно сформировать бригаду
            groups += 1
            i += c
        else:
            # Эта группа не подходит, пропускаем первого человека
            i += 1
    # возвращаем 1, если сформировали ровно r бригад
    return groups == r

# в классе учится человек, кол-во бригад, кол-во человек в бригаде
n, r, c = map(int, input().split())

a = [int(input()) for _ in range(n)]

a.sort()

# Проверяем, достаточно ли людей
if n < r * c:
    print(-1)
    exit()

left = -1
# Максимально возможная разность в росте 
right = a[-1] - a[0] + 1

while right - left > 1:
    mid = (left + right) // 2
    
    if ok(mid):
        # уменьшаем допустимую разницу в росте
        right = mid
    else:
        left = mid
# right - это максимальное из наименьших значений, при котором функция ok() вернула True
print(right)