def good(days):
    # (кол-во всего дней - (все дни // k дней работает до отдыха))* кол-во срубленных деревьев
    # из всего срока вычитаем выходние дни и умножаем на кол-во деревьев в день
    # узнаём сколько человек вырибит деревьев за весь срок
    dmitry = (days - days // k) * a
    fedor = (days - days // m) * b
    # больше ли работники вырубили, чем всего деревьев 
    return dmitry + fedor >= x

# кол-во срубленных дервевьев Дмитрием, 
# каждый k-ый день Дмитрий отдыхает,кол-во срубленных дервевьев Дмитрием,
# каждый k-ый день Фёдор отдыхает, всего растёт деревьев
a, k, b, m, x = map(int, input().split())


left = 0
right = 10**18

# ищем за сколько миним кол-во дней срубят деревья Ф и Д
while right - left > 1:
    mid = (left + right) // 2

    if good(mid):
        # если работники могут вырубить больше нужного деревьев, то уменьшаем срок работ
        right = mid
    else:
        left = mid

# кол-во дней они могут вырубить лес
print(right)